title: Detection of Base64 Encoding in Windows Command Line Tools
id: 1e2761a2-704f-45b0-87a4-409a1fc1f0be
status: experimental
description: Monitors for instances where cmd.exe or powershell.exe execute commands containing references to Base64 encoding, a technique often leveraged for obfuscation and evasion. This detection approach is based on observed tactics in real-world threat intelligence reports, including insights from 2022.
references:
    - https://redcanary.com/threat-detection-report/techniques/obfuscated-files-information/
author: BlackPerl
date: 2024-12-15
tags:
    - attack.defense_evasion
    - attack.t1140
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\powershell.exe'
            - '\cmd.exe'
        CommandLine|contains: 'base64'
    condition: selection
falsepositives:
    - Windows Config Manager (https://wtfbins.wtf/1)
level: high