title: Detection of Drupwn Tool Activity
id: 60c3a8fd-8bca-443d-b8f6-618bfbffe432
status: stable
description: Detects the use of the Drupwn reconnaissance tool, commonly employed for Drupal enumeration and potential exploitation attempts.
references: 'https://github.com/immunIT/drupwn'
author: BlackPerl
date: 2024-12-15
tags:
  - 'attack.T1190'
  - 'attack.T1210'
  - 'attack.TA0001'
  - 'attack.TA0002'
  - 'attack.TA0009'
logsource:
  category: 'process_creation'
  product: 'windows'
detection:
  selection:
    Image|endswith: 
      - 'drupwn.exe'
      - 'drupwn'
    CommandLine|contains|all:
      - 'drupwn'
    OriginalFileName: 'drupwn.exe'
  condition: selection
falsepositives:
  - Legitimate security testing with Drupwn by authorized personnel.
level: medium