title: Detection of VPN-Related Keywords Linked to 1clickVPN
id: 684b840f-c0cb-400b-b0d5-11f045379d33
status: experimental
description: Detects occurrences of keywords tied to 1clickVPN within critical system fields, focusing on identifying potential security risks and unauthorized usage patterns.
references: 
  - https://raw.githubusercontent.com/SigmaHQ/sigma/43277f26fc1c81fc98fc79147b711189e901b757/rules/windows/registry/registry_set/registry_set_chrome_extension.yml
author: BlackPerl
date: 2024-12-15
tags:
  - 'attack.T1090.003'
  - 'attack.T1133'
  - 'attack.T1572'
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains: 'fcfhplploccackoneaefokcmbjfbkenj'
    CommandLine|contains: 'fcfhplploccackoneaefokcmbjfbkenj'
    ParentImage|endswith:
      - '\cmd.exe'
      - '\powershell.exe'
  condition: selection
falsepositives:
  - Legitimate use of 1clickVPN for administrative or business purposes.
level: medium