title: Identification of 64-bit Havoc Demon Hash Activity
id: bc383c89-2512-4a05-8c17-0900adb6a7af
status: experimental
description: Detects file creation, modification, or execution events linked to hashes associated with the 64-bit Havoc Demon, a known adversarial tool used in post-exploitation activities.
references:
  - https://blog.talosintelligence.com/threat-actors-using-macropack
author: BlackPerl
date: 2024-12-15
tags:
  - attack.execution
logsource:
  product: windows
  category: file_executable_detected
detection:
  selection:
    sha256: 0cf1e59bae9dba7fbbf6ee6a36ca6bdb8fa0ac002b8cf824bd0888789a981c57
  condition: selection
falsepositives:
  - Unknown. Hashes are unique to files, and this hash has been identified as malicious. Any detection should be investigated.
level: high
