title: Keyword-Based Identification of Digispark Attiny85 Activity
id: 3f5277d0-09f7-41e7-b2e3-88d8f1a00b44
status: experimental
description: Detects the activity linked to the Digispark Attiny85 USB tool by analyzing keywords and unique identifiers across relevant log fields, potentially indicating unauthorized or malicious use.
references:
  - 'https://github.com/mthcht/awesome-lists/blob/main/Lists/suspicious_usb_ids_list.csv'
author: BlackPerl
date: 2024-12-15
tags:
  - attack.T1056
  - attack.T1204
  - attack.TA0001
  - attack.TA0009
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains: 
      - 'USB\\VID_16D0&PID_0753'
      - 'Digispark'
      - 'Attiny85'
      - 'payload'
      - 'duckyscript'
    Image|endswith:
      - 'powershell.exe'
      - 'cmd.exe'
      - 'rundll32.exe'
    ParentImage|endswith:
      - 'explorer.exe'
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - OriginalFileName
  - ProcessPath
  - Device
  - CurrentDirectory
  - RegistryPath
  - RegistryValueName
  - Description
falsepositives:
  - Legitimate usage of Digispark Attiny85 in educational, development, or research scenarios.
  - Debugging activity using USB-related tools.
level: medium