title: Detection of In-Memory Implant Techniques Linked to Brute Ratel C4
id: 876d1f68-f023-4bf9-8854-b493c8cfb937
status: experimental
description: Identifies behaviors associated with Brute Ratel C4 Badger, an in-memory implant that leverages the Sleep API for stealthy persistence and CreateRemoteThread for process injection.
references:
  - https://any.run/cybersecurity-blog/brute-ratel-c4-analysis
author: BlackPerl
date: 2024-12-15
tags:
  - attack.persistence
logsource:
  product: windows
  category: create_remote_thread
detection:
  selection:
    TargetProcessId|endswith: FFFFFFFFFFFFFFFF
    StartFunction|contains: Sleep
    StartAddress|contains: VirtualAllocEx
    StartModule|contains: WriteProcessMemory
  condition: selection
falsepositives:
  - Legitimate use of CreateRemoteThread by trusted applications
level: high
