 title: Detection of BANSHEE Infostealer Indicators
 id: 77b16e2b-5bc2-47b0-bb98-08321078891a
 description: Detects activity associated with the BANSHEE infostealer, leveraging known SHA-256 hashes and command-and-control (C2) IP addresses to identify potential infections.
 references:
 - https://www.elastic.co/security-labs/beyond-the-wail
 status: experimental
 author: BlackPerl
 date: 2024-12-15
 tags:
 - attack.command_and_control
 - attack.execution
 logsource:
 category: process_creation
 product: windows
 detection:
 selection:
 - TargetFilename|endswith: "".exe""
 - Hashes.sha256: ""11aa6eeca2547fcf807129787bec0d576de1a29b56945c5a8fb16ed8bf68f782""
 network_traffic:
 - dst_ip: ""45.142.122.92""
 condition: selection or network_traffic
 falsepositives:
 - Unknown executables with matching SHA-256
 level: high