title: Suspicious Process Injection Targeting svchost.exe (FIN7 TTPs)
id: a4eeed18-3170-43b8-86d2-88033e275fa3
status: experimental
description: Identifies process injection attempts into svchost.exe, a tactic frequently associated with FIN7 operations. Detection is based on the presence of specific payload names linked to this threat actor's techniques.
references:
  - https://labs.withsecure.com/publications/fin7-target-veeam-servers
author: BlackPerl
date: 2024-12-15
tags:
  - attack.t1055
  - attack.defense-evasion
logsource:
  product: windows
  category: create_remote_thread
detection:
  selection:
    TargetImage: C:\\Windows\\system32\\svchost.exe
    StartFunction|contains:
      - Plug&Play
      - DoomLaunch
  condition: selection
falsepositives:
  - Legitimate software that uses similar injection techniques for non-malicious purposes
level: high
